import React from "react";
import "./About.scss";
import { Delimiter } from "../Delimiter/Delimiter";
import  gsap from "gsap"

export const About = () => {



  return (
    <section>
      <div className= "about_wrapper">
        <div className="about_blockTitle">
          <h2 className="about_title">Про нас</h2>
          <p>
            Привітайте у <b>"BlendStore"</b> - одну з провідних компаній у сфері
            зернових продуктів та інгредієнтів. Ми пишаємося тим, що пропонуємо
            широкий асортимент високоякісних зернових продуктів, які допомагають
            нашим клієнтам прийняти здорове харчування та досягти своїх цілей.
          </p>
        </div>

        <div className="about_blockSubTitle">
          <img  src="/img/About 1.png" alt="" />
          <div className="block_costomers">
            <div>
              <span>1000+</span>
              <h3>Щасливих клієнтів</h3>
            </div>
            <div>
              <span>30+</span>
              <h3>різних сортів кави</h3>
            </div>
            <div>
              <span>24/7</span>
              <h3>Працюємо заради вас</h3>
            </div>
          </div>
          <div className="about_blockText">
            <p>
              Ми пропонуємо широкий асортимент понад 30 різних сортів кави,
              зібраних з усього світу. Наші кавові зерна постачаються від 3
              провідних постачальників, які проходять ретельний відбір, щоб
              гарантувати найвищу якість.
            </p>
            <p>
              Приєднуйтесь до нас у нашому прагненні запропонувати вам найкращий
              кавовий досвід. Ми готові перетворити кожну чашку на чарівницю з
              <b> BlendStore</b> - вашим надійним джерелом справжньої кавової
              насолоди.
            </p>
          </div>
        </div>
      </div>
      <Delimiter />
    </section>
  );
};

/* BlendStore - это ваш надежный партнер в мире кофе. Мы - команда любителей и профессионалов, которые собрались вместе, чтобы поделиться своей страстью к кофе с вами.

Мы верим, что каждая чашка кофе заслуживает быть наивысшего качества. Поэтому мы тщательно отбираем только самые лучшие кофейные зерна от надежных поставщиков со всего мира. Мы стремимся предложить вам широкий выбор сортов кофе, чтобы удовлетворить самые изысканные вкусы.

Наша миссия - сделать покупку кофе простой и приятной для вас. Мы предлагаем удобный интернет-магазин, где вы можете легко выбрать и заказать свои любимые сорта кофе и аксессуары. Мы также готовы поделиться нашими знаниями и опытом, чтобы помочь вам выбрать и приготовить кофе идеальным образом.

Наша команда всегда готова выйти на помощь. Мы ценим каждого клиента и стремимся обеспечить превосходное обслуживание. Наша цель - не только продать кофе, но и создать надолго продолжающиеся отношения с нашими клиентами.

Присоединяйтесь к нам на нашем пути в мире кофе. Разбудите свои чувства с BlendStore - вашим источником настоящего кофейного удовольствия. */
